# AssemblyDifferenceNamingCategory Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssemblyDifferenceNamingCategory Class
Members See Also
---
The two assemblies being compared have different naming categories
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class AssemblyDifferenceNamingCategory : AssemblyDifference
```

Visual Basic
---
```text
Public Class AssemblyDifferenceNamingCategory _
	Inherits AssemblyDifference
```

Visual C++
---
```text
public ref class AssemblyDifferenceNamingCategory : public AssemblyDifference
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..AssemblyDifference Autodesk.Revit.DB..::..AssemblyDifferenceNamingCategory
# See Also
AssemblyDifferenceNamingCategory Members
Autodesk.Revit.DB Namespace